{"added":"2023-04-11T09:57:03.044571+00:00","attributes":{"random_number_v1__random_number_v1__random":[[0,9626,0.11918]]},"created":"2020-01-17T12:48:23Z","id":"http://250news.theexplorationplace.com/www.250news.com/65595.html","metadata":{"bucket":"head","cc_segment":"crawl-data/CC-MAIN-2020-05/segments/1579250589560.16/wet/CC-MAIN-20200117123339-20200117151339-00000.warc.wet.gz","date_download":"2020-01-17T12:48:23Z","digest":"sha1:K2RJ3HQ73U7W4LKKI2JVVGZ4ABQFRF6Q","language":"en","language_score":0.97,"length":13925,"line_ids":[27,29,30,31,32,33,34,35,36,37,38,39,40,41,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,62,63,64,65,67,68,69,70,71,72,73,75,76,77,78,79,80,81,82,84,85,86,88,89,90,91,92,93,94,95,96,97,98,99,100,102,104,105,106,107,108,109,110,111,112,113,116,119,120,121,122,123,124],"nlines":85,"original_length":15502,"original_nlines":130,"perplexity":321.5,"source_domain":"250news.theexplorationplace.com","title":"250 News | RiverBend Project Shows PG is “Open for Business”","url":"http://250news.theexplorationplace.com/www.250news.com/65595.html"},"source":"common-crawl","text":"Prince George, B.C.- Construction of the new RiverBend Seniors housing project in Prince George is well underway, but it’s a project that almost didn’t happen.\nThe $33 million dollar project was first presented to Mayor and Council in 2013 “We didn’t get much traction at that time” says developer Frank Quinn of A&T Ventures. He says it wasn’t until Mayor Lyn Hall was elected that the wheels were set in motion.\nHall and key members of the City Staff, arranged to meet with Quinn in Kamloops and laid out the possible benefits of developing such a project in P.G. Those benefits include: a ten year tax break, and just over $265 thousand dollars in development cost charges relief plus an affordable housing grant of $855 thousand.\n“This project comes at the perfect time for us” says Gwen Norheim. She and her husband are among those who have already purchased a unit and expect to move to their new condo in the fall of 2017. “We were at the point of knowing we would need to move, but didn’t want to move into any of the existing facilities in Prince George.” Norheim was a teacher at the Connaught Junior High School which was on the neighbouring property until it burned to the ground. “In all my years of teaching I never imagined I would be living in its backyard.” She is also pleased their little dog, a small poodle terrier mix, will be able to live with them.\nQuinn says they did make an interesting discovery when they started construction, “The creek ran right through the property. Even though we had done our geo-tech work, we had no idea until we got into the ground how much of a challenge that was going to be for an excavation.” But he says their past experience in dealing with alpine construction and avalanche trenches gave them the know-how to deal with it.\nThat’s it, big smiles Shirley and Mike… there is an election coming.\nThis is an excellent and well needed project!\nIf the NDP was in power (god forbid) and it was NDP MLA’s in the picture, you would be the first to be all over it, praising them and the NDP to no end!!\nGo ahead and deny it if you want, but we know better!\nWhat we do know with the liberals is they are always raising fees and medical costs for retired seniors..and also charging them more every year for staying in senior housing.. All the seniors really appreciate being driven into poverty after paying taxes all their lives.. Thanks liberals.\ngrow up galt.\nOkay, so we get rid of all our debt. Let us say that the last little bit will be taken care of in 20 years from now. As time progresses, there will be progressively more money available to spend on parks, to spend on no tax increase for a few years until inflation starts catching up, and so on.\nWe will then buy new buildings, additions, infrastructure, enhancements of one sort or other, rebuilding old stock, etc. at 2036 dollars which will have 20 years inflation on them. EXCEPT, we cannot do that until we have saved for these new buildings and other infrastructure so we can see such development 40 years from now.\nGreat planning! Good understanding of how the operation of a City works and how financing city development works.\nGreen parks???? forget abut it. Learn to design them so that they are as natural as possible.\nHave a walk sometimes on the cover of the First Avenue landfill. That is the way to design low maintenance “parks”. Forget about Rainbow, Connaught Hill, Fort George/Lheitli Tenneh, etc. Just like they have forgotten about Cottonwood Island Park and the Heritage Riverfront Trail system.\nYess the owners of the condos can save money too if they tap into the creek that runs underneath.\nI see we really do not give a chit about housing for seniors, do we???\nSeems like a great project to me . I could be wrong but what is wrong with keeping more seniors in Prince George?\nNothing, just the usual curmudgeons that believe every project is a personal assault on their lives, all change is bad and anytime you even see a politician it must be a self serving photo-op.\nWhat is great about a project that only got built due to all the corporate welfare that it received? Cons just love to go on and on about the wonders of Capitalism over Socialism, but this thing only got built due to corporate socialism. The mayor and council of this city should put a sign that reads “For Sale…cheap” outside of council Chambers.\nThe income tax being paid by construction workers on this project will more than pay for any so called corporate welfare.\nRemember, the City does not collect any income tax. Now it will not collect any property tax for 10 years either.\nThis is the slow incursion of the City getting into the housing business, another download from the provincial government. Anything BC Housing has been getting into in the recent past reeks of Provincial Government download of responsibility without the necessary transfer of funds to the City. This is simply a hidden Triple P project.\n18 of the market units have already been sold! Seems that demand for these units is already there!\nI for one have parents who are in their very golden years. A facility like this, especially next door to Gateway, will be well utilized and much appreciated by those that will live there and by those who will be able to easily visit elderly family members who will choose to stay here instead of moving south!\nSounds like a win for those that will live there, those who’s family will live there, those who will work there and those who will benefit from the economic activity generated from the retirement funds that will be spent here instead of in the Okanagan or other points down south!\nWhat is so special about being close to Gateway? Are they in the market for cars, mufflers, tires, motel room rentals? Do they need to be close to a new Firehall?\nPerhaps they eat a lot of Big Macs or Popa and Moma Burgers or 711 wedges.\nThe Gateway might be a clean-look route to drive through, but it is not exactly a shopping, restaurant or entertainment mecca.\nCome to think of it, which part of PG is, other than parts of downtown plus the major shopping centres.\n1? What about all the other projects that developers walk away from, because the city is truly not ‘open for business’. Change the archaic zoning bylaws. Get Ospika built. \nSomeone might want to ask a few questions. As an example do you think that a 10 year tax break, along with $265,000.00 in development cost charges relief, plus the $855,000.00 affordable housing grant is a little excessive.\nWho will own the rental units when the project is completed. My understanding is that the Government will own 33 units and Oncore Seniors Society, received financing from the Government over a long period of time, and they will own the other 33 units. The contractor of course will sell the other 107 Units. One assumes at a hefty profit.\nMy understanding is that these rental units will be available for low to moderate income seniors. Hmmmm. Where does one go to get on the waiting list.\nThese are one bedroom units with a space for a micro wave (Not provided) and while some aspects of it are pretty good, in actual fact, we end up with putting all this money into a project and end up with 33 units. Hmmmm.\nPerhaps gopg2015 could do some of his research and come up with a dollar number for the cost per unit, and perhaps some inkling as to how one can access these rentals.\nThe Government has similar projects in Squamish, Kamloops, Peachland, etc; so this is not exactly new.\nPalopu, your comment shows us the amount of homework and research you did to support your assertions… my thumbs up!\nThere is insufficient information to come up with a cost per unit. The proper measure of such a development is the cost per square foot and then attribute that to units of varying sizes.\nThere would also be a difference between the market housing and the subsidized housing portion.\nFinally, I would want to want some info on which tax dollars are attributable to what portion of the development.\nWhat I am really trying to get at is why should anyone in the public have to do such calculations? This is a mixed housing project, and the taxpayer is funding part of it.\nThis City has not yet learned the notion transparency.\nIn this case they and the province need to prepare a prospectus of the project, the amount of subsidies provided by the taxpayer to something which few us will see any direct benefits from, the benefits which will accrue to the general population, who will be the source of the majority of the funds, and which services we will not see for general application to our annual budget deliberations, and so forth.\nI think THAT is the message we need to keep hammering the City as well as the province with. We should not have to second guess such information or spend more than a minute on finding the information.\nThis looks like its going to be a successfull project with obvious demand for the units. How come it took a company from Kamloops to make this happen? The developers in PG seem to be very risk adverse and lack the vision and capasity to grow this city to its potential.\nThis is one of those statements that could actually be very good or very bad . . .\nIn my estimation it is more often bad from the taxpayer’s point of view.\nThere needs to be a reporting out to the citizens of PG of the actual cost to the City of the subsidy provided and the measurable value received in return stated both in quality and in monetary quantity..\nLike to get the names of the voters who voted for A. The Harper Conservatives B. The BC Liberals. Just get a good look.\nI voted for both. I’ll show you my name if you show me yours."}
